<a href="https://colab.research.google.com/github/VATHSAV2004/EDA_imp_libraries/blob/main/Pandas_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas
- 1.Series
- 2.Dataframes

In [3]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

# 1.Series

In [4]:
data=["10",20,30,40,50]
s1=pd.Series(data)
s1

0    10
1    20
2    30
3    40
4    50
dtype: object

In [5]:
s1.dtype # q)why datatype is object

dtype('O')

In [6]:
data=[10,20,30,40,50]
s1=pd.Series(data)
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [7]:
data=[10.0,20,30,40,50]
s1=pd.Series(data)
s1

0    10.0
1    20.0
2    30.0
3    40.0
4    50.0
dtype: float64

In [8]:
type(s1)

pandas.core.series.Series

In [9]:
s1.values # returns the data in the form of ndarray

array([10., 20., 30., 40., 50.])

In [10]:
type(s1.values)

numpy.ndarray

In [11]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [12]:
s1.dtype

dtype('float64')

In [13]:
list(s1.index)

[0, 1, 2, 3, 4]

In [14]:
type(s1.index)

pandas.core.indexes.range.RangeIndex

* When you do something like:

python
Copy code
s1.index = ['a', 'b', 'c']
you’re indeed assigning to an attribute, but internally pandas doesn’t just replace a variable — it runs through some setter logic that updates the Series' internal metadata.

Step-by-step of what happens internally
.index in pandas is a property

It has both a getter (@property) and a setter (@index.setter) defined in the Series class.

When you write s1.index = ..., Python calls the setter method, not just a variable assignment.

Setter validation

Pandas checks that the new index object is the same length as the Series' data.

If lengths differ, it raises:

makefile
Copy code
ValueError: Length mismatch
Conversion to Index object

If you passed a list (or NumPy array), pandas wraps it:

python
Copy code
new_index = pd.Index(['a', 'b', 'c']) *

In [15]:
s1.index=[101,102,103,104,105]
s1

101    10.0
102    20.0
103    30.0
104    40.0
105    50.0
dtype: float64

In [16]:
s1.index=['A','B','C','D','E']
s1

A    10.0
B    20.0
C    30.0
D    40.0
E    50.0
dtype: float64

In [17]:
s1.index=range(1001,1006)
s1

1001    10.0
1002    20.0
1003    30.0
1004    40.0
1005    50.0
dtype: float64

In [18]:
s1.index=[1.5,2.5,3.5,4.5,5.5]
s1

1.5    10.0
2.5    20.0
3.5    30.0
4.5    40.0
5.5    50.0
dtype: float64

In [19]:
s1.index

Index([1.5, 2.5, 3.5, 4.5, 5.5], dtype='float64')

## Accessing data in series

In [20]:
s1.index=['A','B','C','D','E']
s1

A    10.0
B    20.0
C    30.0
D    40.0
E    50.0
dtype: float64

In [21]:
s1.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [22]:
s1[3]

np.float64(40.0)

In [23]:
s1['A']

np.float64(10.0)

- first check series label if not there check index
-s1[] works for label and index
-for particulary index we use iloc

In [24]:
s1[-1]

np.float64(50.0)

In [25]:
s1.iloc[2] # by positional indexing

np.float64(30.0)

In [26]:
s1.loc['A'] # by index that has been provided

np.float64(10.0)

In [27]:
s1.iloc[[1,2,4]] # return series of values present in index list

B    20.0
C    30.0
E    50.0
dtype: float64

In [28]:
s1.loc[['A','B','C']]

A    10.0
B    20.0
C    30.0
dtype: float64

In [29]:
s1['F']=60
s1

A    10.0
B    20.0
C    30.0
D    40.0
E    50.0
F    60.0
dtype: float64

In [30]:
s1['D']=80
s1

A    10.0
B    20.0
C    30.0
D    80.0
E    50.0
F    60.0
dtype: float64

In [31]:
s2=s1.drop('D',inplace=False)
s1

A    10.0
B    20.0
C    30.0
D    80.0
E    50.0
F    60.0
dtype: float64

In [32]:
s1.drop('D',inplace=True) # inplace=True makes the change permanent in the original series
s1

A    10.0
B    20.0
C    30.0
E    50.0
F    60.0
dtype: float64

## Slicing

In [33]:
s1[:]

A    10.0
B    20.0
C    30.0
E    50.0
F    60.0
dtype: float64

In [34]:
s1[::-1]

F    60.0
E    50.0
C    30.0
B    20.0
A    10.0
dtype: float64

In [35]:
s1[::2]

A    10.0
C    30.0
F    60.0
dtype: float64

In [36]:
s1[-1::-1]

F    60.0
E    50.0
C    30.0
B    20.0
A    10.0
dtype: float64

## Creating Series from a Dictionary

In [37]:
data={'Mohit':85,
      'Ankit':80,
      'Anjali':86,
      'Varun':81}
s=pd.Series(data)
s

Mohit     85
Ankit     80
Anjali    86
Varun     81
dtype: int64

In [38]:
s['Mohit']

np.int64(85)

In [39]:
data={'Jaipur':'Rajasthan',
      'Mumbai':'Maharashtra',
      'Kolkata':'West Bengal',
      'Chandigarh':'Punjab',
      'Bengaluru':'Karnataka'}
data

{'Jaipur': 'Rajasthan',
 'Mumbai': 'Maharashtra',
 'Kolkata': 'West Bengal',
 'Chandigarh': 'Punjab',
 'Bengaluru': 'Karnataka'}

In [43]:
s2=pd.Series(data)
s2

Jaipur          Rajasthan
Mumbai        Maharashtra
Kolkata       West Bengal
Chandigarh         Punjab
Bengaluru       Karnataka
dtype: object

In [44]:
s2['Jaipur']

'Rajasthan'

In [45]:
s2[0]

'Rajasthan'

In [46]:
s2.index

Index(['Jaipur', 'Mumbai', 'Kolkata', 'Chandigarh', 'Bengaluru'], dtype='object')

In [47]:
s2.values

array(['Rajasthan', 'Maharashtra', 'West Bengal', 'Punjab', 'Karnataka'],
      dtype=object)

In [48]:
s2.loc['Jaipur']

'Rajasthan'

In [49]:
s2.iloc[2]

'West Bengal'

In [50]:
s2.name='States and Capitals'
s2

Jaipur          Rajasthan
Mumbai        Maharashtra
Kolkata       West Bengal
Chandigarh         Punjab
Bengaluru       Karnataka
Name: States and Capitals, dtype: object

In [51]:
s2.name

'States and Capitals'

In [55]:
s2.index.name="Capitals"

In [56]:
s2

Capitals
Jaipur          Rajasthan
Mumbai        Maharashtra
Kolkata       West Bengal
Chandigarh         Punjab
Bengaluru       Karnataka
Name: States and Capitals, dtype: object

In [57]:
s2[['Jaipur','Mumbai','Kolkata']]

Capitals
Jaipur       Rajasthan
Mumbai     Maharashtra
Kolkata    West Bengal
Name: States and Capitals, dtype: object

In [61]:
roll_no=[101,102,103,104,105]
result=[88,89,93,85,96]

s3=pd.Series(data=result,index=roll_no)
s3.name='Final Result'
s3.index.name='Roll no'
s3

Roll no
101    88
102    89
103    93
104    85
105    96
Name: Final Result, dtype: int64

In [62]:
s2

Capitals
Jaipur          Rajasthan
Mumbai        Maharashtra
Kolkata       West Bengal
Chandigarh         Punjab
Bengaluru       Karnataka
Name: States and Capitals, dtype: object

In [63]:
capitals=['Jaipur','Kolkata','Mumbai']
s4=pd.Series(data=s2,index=capitals)
s4

Jaipur       Rajasthan
Kolkata    West Bengal
Mumbai     Maharashtra
Name: States and Capitals, dtype: object

In [64]:
capitals=['Jaipur','Kolkata','Mumbai','Delhi','Chennai']
s5=pd.Series(data=s2,index=capitals)
s5

Jaipur       Rajasthan
Kolkata    West Bengal
Mumbai     Maharashtra
Delhi              NaN
Chennai            NaN
Name: States and Capitals, dtype: object

## Functions

In [66]:
s5.isnull() # check for missing values

Jaipur     False
Kolkata    False
Mumbai     False
Delhi       True
Chennai     True
Name: States and Capitals, dtype: bool

In [67]:
s5.notnull()

Jaipur      True
Kolkata     True
Mumbai      True
Delhi      False
Chennai    False
Name: States and Capitals, dtype: bool

In [68]:
type(s5)

pandas.core.series.Series

In [69]:
s5.isnull().sum()

np.int64(2)

In [70]:
s5.notnull().sum()

np.int64(3)

In [71]:
s5

Jaipur       Rajasthan
Kolkata    West Bengal
Mumbai     Maharashtra
Delhi              NaN
Chennai            NaN
Name: States and Capitals, dtype: object

In [73]:
s5['Bengaluru']='Karnataka'
s5

Jaipur         Rajasthan
Kolkata      West Bengal
Mumbai       Maharashtra
Delhi                NaN
Chennai              NaN
Bengaluru      Karnataka
Name: States and Capitals, dtype: object

In [75]:
s5.head()  # give top 5

Jaipur       Rajasthan
Kolkata    West Bengal
Mumbai     Maharashtra
Delhi              NaN
Chennai            NaN
Name: States and Capitals, dtype: object

In [76]:
s5.head(5)

Jaipur       Rajasthan
Kolkata    West Bengal
Mumbai     Maharashtra
Delhi              NaN
Chennai            NaN
Name: States and Capitals, dtype: object

In [78]:
s5.tail() # last 5 rows by default

Kolkata      West Bengal
Mumbai       Maharashtra
Delhi                NaN
Chennai              NaN
Bengaluru      Karnataka
Name: States and Capitals, dtype: object

In [79]:
s5.tail(3)

Delhi              NaN
Chennai            NaN
Bengaluru    Karnataka
Name: States and Capitals, dtype: object

In [80]:
s5

Jaipur         Rajasthan
Kolkata      West Bengal
Mumbai       Maharashtra
Delhi                NaN
Chennai              NaN
Bengaluru      Karnataka
Name: States and Capitals, dtype: object

In [82]:
s5['Pune']='Maharashtra'
s5

Jaipur         Rajasthan
Kolkata      West Bengal
Mumbai       Maharashtra
Delhi                NaN
Chennai              NaN
Bengaluru      Karnataka
Pune         Maharashtra
Name: States and Capitals, dtype: object

In [84]:
s5.index=range(101,108)
s5

101      Rajasthan
102    West Bengal
103    Maharashtra
104            NaN
105            NaN
106      Karnataka
107    Maharashtra
Name: States and Capitals, dtype: object

In [85]:
s5[108]='Maharashtra'
s5[109]='Maharashtra'
s5

101      Rajasthan
102    West Bengal
103    Maharashtra
104            NaN
105            NaN
106      Karnataka
107    Maharashtra
108    Maharashtra
109    Maharashtra
Name: States and Capitals, dtype: object

In [89]:
s5.duplicated() # first time appeared give true then after it appears give false

101    False
102    False
103    False
104    False
105     True
106    False
107     True
108     True
109     True
Name: States and Capitals, dtype: bool

In [90]:
s5.duplicated().sum()

np.int64(4)

In [99]:
s5.dropna(inplace=True) # remove null values

1️⃣ When you use inplace=False (default)
python
Copy code
s5 = s5.dropna()   # or print(s5.dropna())
dropna() returns a new Series with the null values removed.

You can directly print() this returned Series.

The original s5 is unchanged unless you assign it back.

2️⃣ When you use inplace=True
python
Copy code
s5.dropna(inplace=True)
The operation is done on the same object (modifies s5 in place).

Nothing is returned — dropna() returns None in this mode.

That’s why if you try:

python
Copy code

In [102]:
s5

101      Rajasthan
102    West Bengal
103    Maharashtra
106      Karnataka
Name: States and Capitals, dtype: object

In [100]:
s5.dropna().duplicated().sum()

np.int64(0)

In [101]:
s5.drop_duplicates(inplace=True) # drop duplicated in original series